const arr = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];

let positive = 0;
let posSum = 0;

// Знайти суму та кількість позитивних елементів.
// Знайти мінімальний елемент масиву та його порядковий номер.

let min = 0;
// Знайти максимальний елемент масиву та його порядковий номер.
let max = 0;
// Визначити кількість негативних елементів.
let negative = 0;


// Знайти кількість непарних позитивних елементів.
let posOdd = 0;

// Знайти кількість парних позитивних елементів.
// Знайти суму парних позитивних елементів.

let posEven = 0;


// Знайти суму непарних позитивних елементів.

// Знайти добуток позитивних елементів.

// Знайти найбільший серед елементів масиву, остальні обнулити.